tangyangguang/Esp32Base/examples/full_demo/src/main.cpp
#include <Arduino.h>
#include <Esp32Base.h>
#include <WiFi.h>

static const char* APP_NS = "demo";
static const char* APP_KEY_BOOT = "boot";
static const char* APP_KEY_META = "meta";
static const char* APP_KEY_VALUE = "value";
static const char* APP_KEY_CODE = "code";
static const char* APP_KEY_LIMIT = "limit";
static const char* APP_KEY_MULTIPLIER = "mult";
static const char* APP_KEY_OFFSET = "offset";
static const char* APP_KEY_TIMEOUT = "timeout";
static const char* APP_KEY_ENABLED = "enabled";
static const char* APP_KEY_SAFE = "safe";
static const char* APP_KEY_MODE = "mode";
static const char* APP_KEY_PROFILE = "profile";
static const char* APP_KEY_MIN_RAW = "minraw";

struct DemoMeta {
    uint32_t boot;
    uint32_t nextId;
    uint32_t marker;
};

const Esp32BaseAppConfig::EnumOption MODE_OPTIONS[] = {
    {"auto", "Auto"},
    {"manual", "Manual"},
    {"service", "Service"}
};

const Esp32BaseAppConfig::EnumOption PROFILE_OPTIONS[] = {
    {"quiet", "Quiet"},
    {"balanced", "Balanced"},
    {"fast", "Fast"}
};

bool validateAsciiValue(const Esp32BaseAppConfig::FieldRef&, const Esp32BaseAppConfig::FieldValue& value, char* error, size_t errorLen) {
    const char* s = value.text ? value.text : "";
    for (size_t i = 0; s[i]; ++i) {
        const char c = s[i];
        const bool ok = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') || (c >= '0' && c <= '9') || c == '_' || c == '-';
        if (!ok) {
            strlcpy(error, "Value may contain only letters, digits, underscore and hyphen.", errorLen);
            return false;
        }
    }
    return true;
}

bool validateAppConfigPage(char* error, size_t errorLen) {
    int32_t limit = 0;
    int32_t multiplier = 0;
    if (!Esp32BaseAppConfig::submittedInt(APP_NS, APP_KEY_LIMIT, limit) ||
        !Esp32BaseAppConfig::submittedDecimal(APP_NS, APP_KEY_MULTIPLIER, multiplier)) {
        strlcpy(error, "Submitted App Config values are unavailable.", errorLen);
        return false;
    }
    if (multiplier > limit * 100) {
        strlcpy(error, "Multiplier cannot be greater than limit.", errorLen);
        return false;
    }
    return true;
}

void onAppConfigChange(const Esp32BaseAppConfig::Change& change) {
    ESP32BASE_LOG_I("appcfg", "changed key=%s old=%s new=%s",
                    change.field.key,
                    change.oldValue.text ? change.oldValue.text : "-",
                    change.newValue.text ? change.newValue.text : "-");
}

void onAppConfigSave(const Esp32BaseAppConfig::SaveSummary& summary) {
    ESP32BASE_LOG_I("appcfg", "save changed=%u saved=%u failed=%u restart=%s",
                    summary.changedCount,
                    summary.savedCount,
                    summary.failedCount,
                    summary.restartRequired ? "yes" : "no");
}

#ifndef ESP32BASE_FULL_DEMO_SELFTEST
#define ESP32BASE_FULL_DEMO_SELFTEST 0
#endif

#if ESP32BASE_FULL_DEMO_SELFTEST
static bool g_selfTestDone = false;

size_t selfTestAdvanceMatch(const char* pattern, size_t patternLen, size_t matched, char c) {
    while (matched > 0 && c != pattern[matched]) {
        size_t next = matched - 1;
        while (next > 0 && strncmp(pattern, pattern + matched - next, next) != 0) {
            --next;
        }
        matched = next;
    }
    if (c == pattern[matched]) {
        ++matched;
        if (matched > patternLen) {
            matched = patternLen;
        }
    }
    return matched;
}

bool selfTestRequest(const char* method, const char* path, const char* body, bool auth, int expectedCode, const char* mustContain) {
    WiFiClient client;
    const IPAddress targetIp = Esp32BaseWiFi::state() == Esp32BaseWiFi::CONFIG_PORTAL ? WiFi.softAPIP() : WiFi.localIP();
    if (!client.connect(targetIp, 80)) {
        ESP32BASE_LOG_E("selftest", "%s %s connect_failed", method, path);
        return false;
    }
    client.print(method);
    client.print(" ");
    client.print(path);
    client.print(" HTTP/1.1\r\nHost: ");
    client.print(targetIp);
    client.print("\r\nConnection: close\r\n");
    if (auth) {
        client.print("Authorization: Basic YWRtaW46YWRtaW4=\r\n");
    }
    const size_t bodyLen = body ? strlen(body) : 0;
    if (bodyLen > 0) {
        client.print("Content-Type: application/x-www-form-urlencoded\r\nContent-Length: ");
        client.print(bodyLen);
        client.print("\r\n");
    }
    client.print("\r\n");
    if (bodyLen > 0) {
        client.print(body);
    }

    char statusLine[96];
    size_t statusUsed = 0;
    size_t matchUsed = 0;
    const size_t matchLen = mustContain ? strlen(mustContain) : 0;
    bool contains = !mustContain || matchLen == 0;
    bool firstLineDone = false;
    const uint32_t deadline = millis() + 5000UL;
    while (millis() < deadline && (client.connected() || client.available())) {
        while (client.available()) {
            const char c = static_cast<char>(client.read());
            if (!firstLineDone) {
                if (c == '\n') {
                    firstLineDone = true;
                } else if (c != '\r' && statusUsed + 1 < sizeof(statusLine)) {
                    statusLine[statusUsed++] = c;
                }
            }
            if (!contains && mustContain) {
                matchUsed = selfTestAdvanceMatch(mustContain, matchLen, matchUsed, c);
                if (matchUsed == matchLen) {
                    contains = true;
                }
            }
        }
        Esp32Base::handle();
        Esp32BaseWatchdog::feed();
        delay(1);
    }
    statusLine[statusUsed] = '\0';
    client.stop();

    int code = 0;
    sscanf(statusLine, "HTTP/%*s %d", &code);
    const bool ok = code == expectedCode && contains;
    ESP32BASE_LOG_I("selftest", "%s %s code=%d expected=%d contains=%s result=%s",
                    method, path, code, expectedCode, mustContain ? mustContain : "-",
                    ok ? "pass" : "fail");
    return ok;
}

void runSelfTest() {
    static uint32_t lastWaitLogMs = 0;
    if (g_selfTestDone) {
        return;
    }
    if (!Esp32BaseWeb::isReady()) {
        const uint32_t now = millis();
        if (now - lastWaitLogMs >= 5000UL) {
            lastWaitLogMs = now;
            ESP32BASE_LOG_I("selftest", "waiting wifi=%s web=%s state=%s",
                            Esp32BaseWiFi::isConnected() ? "yes" : "no",
                            Esp32BaseWeb::isReady() ? "yes" : "no",
                            Esp32BaseWiFi::stateName());
        }
        return;
    }
    g_selfTestDone = true;
    const IPAddress targetIp = Esp32BaseWiFi::state() == Esp32BaseWiFi::CONFIG_PORTAL ? WiFi.softAPIP() : WiFi.localIP();
    ESP32BASE_LOG_I("selftest", "start ip=%s state=%s", targetIp.toString().c_str(), Esp32BaseWiFi::stateName());
    const bool wdtRemoved = Esp32BaseWatchdog::removeCurrentTaskForLongOperation();
    uint8_t pass = 0;
    uint8_t total = 0;
#define RUN_SELFTEST(method, path, body, auth, code, contains) do { ++total; if (selfTestRequest(method, path, body, auth, code, contains)) ++pass; } while (0)
#define RUN_BOOL(expr) do { ++total; if (expr) ++pass; } while (0)
    RUN_SELFTEST("GET", "/esp32base/api/status", nullptr, false, 401, "Unauthorized");
    RUN_SELFTEST("GET", "/esp32base/api/status", nullptr, true, 200, "\"profile\":\"FULL\"");
    RUN_SELFTEST("GET", "/esp32base/api/chip", nullptr, true, 200, "\"flash\"");
    RUN_SELFTEST("GET", "/esp32base/api/chip", nullptr, true, 200, "\"chipModel\"");
    RUN_SELFTEST("GET", "/esp32base/api/chip", nullptr, true, 200, "\"efuseMac\"");
    RUN_SELFTEST("GET", "/esp32base/api/firmware", nullptr, true, 200, "\"full-demo\"");
    RUN_SELFTEST("GET", "/esp32base/api/ota", nullptr, true, 200, "\"progress\"");
    RUN_SELFTEST("GET", "/", nullptr, true, 302, "Location: /dashboard");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "<title>Status</title>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "class='statuspage'");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "<div class='tablewrap'><table class='kv'>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Overview");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Hardware");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Firmware &amp; OTA");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Network");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Storage &amp; Logs");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Partition Table");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Boot Reasons");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Firmware</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Chip</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "eFuse MAC</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "STA MAC</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "AP MAC</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "max alloc");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Watchdog</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "lifetime resets");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "trip resets");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "trip reset at");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "<section class='panel healthhero'>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "<div class='healthgrid'>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Firmware / Profile");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Log level</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Current log file</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Current firmware</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "OTA slot minus current sketch</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "Rollback</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "WiFi</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "File log</th>");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "app0");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "app1");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "nvs");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "spiffs");
    RUN_SELFTEST("GET", "/esp32base", nullptr, true, 200, "next OTA");
    RUN_SELFTEST("GET", "/esp32base/wifi", nullptr, true, 200, "<title>Network</title>");
    RUN_SELFTEST("GET", "/esp32base/wifi", nullptr, true, 200, "<section class='panel formpanel wifipanel'><h2>Credentials</h2><form class='editform'");
    RUN_SELFTEST("GET", "/esp32base/wifi", nullptr, true, 200, "<section class='panel dangerpanel'><h2>Clear WiFi</h2>");
    RUN_SELFTEST("GET", "/esp32base/wifi", nullptr, true, 200, "Password (optional)");
    RUN_SELFTEST("GET", "/esp32base/wifi", nullptr, true, 200, "class='secondary' type='button' value='Show/Hide Password'");
    RUN_SELFTEST("GET", "/esp32base/wifi?saved=1", nullptr, true, 200, "Credentials updated and connection started.");
    RUN_SELFTEST("GET", "/esp32base/wifi?error=clear_failed", nullptr, true, 200, "WiFi credentials were not cleared");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "<section class='panel logpanel'><div class='tablewrap'><table class='logmeta'>");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "<th>File log</th><td><b>enabled</b>");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "class='logmeta'");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "class='segname'");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "class='segsize'");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "<th>Max per file</th><td>32.00 KB");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "Open raw log</a>");
    RUN_SELFTEST("GET", "/esp32base/logs", nullptr, true, 200, "class='active' href='/esp32base/logs?segment=0'><span class='segname'>current-0");
    RUN_SELFTEST("GET", "/esp32base/logs?segment=1", nullptr, true, 200, "class='active' href='/esp32base/logs?segment=1'><span class='segname'>history-1");
    RUN_SELFTEST("GET", "/esp32base/logs?segment=99", nullptr, true, 200, "class='active' href='/esp32base/logs?segment=0'><span class='segname'>current-0");
    RUN_SELFTEST("GET", "/esp32base/logs?cleared=1", nullptr, true, 200, "Logs cleared");
    RUN_SELFTEST("GET", "/esp32base/logs?error=clear_failed", nullptr, true, 200, "Logs action failed");
    RUN_SELFTEST("GET", "/esp32base/auth", nullptr, true, 200, "<title>Auth</title>");
    RUN_SELFTEST("GET", "/esp32base/auth", nullptr, true, 200, "<section class='panel formpanel authpanel'><h2>Credentials</h2><form class='editform'");
    RUN_SELFTEST("GET", "/esp32base/auth", nullptr, true, 200, "type='password'");
    RUN_SELFTEST("GET", "/esp32base/auth", nullptr, true, 200, "Confirm new auth password");
    RUN_SELFTEST("GET", "/esp32base/auth", nullptr, true, 200, "New passwords do not match");
    RUN_SELFTEST("GET", "/esp32base/ota", nullptr, true, 200, "<title>OTA</title>");
    RUN_SELFTEST("GET", "/esp32base/ota", nullptr, true, 200, "<section class='panel formpanel uploadpanel'><h2>Firmware upload</h2>");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "<title>System</title>");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "<section class='panel actionpanel'><h2>System settings</h2>");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "System settings");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "WiFi Setup");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Web Auth");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "App Config");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "class='toollinks'");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Application configuration values registered by the app.");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Stored credentials used by station mode and WiFi recovery.");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "HTTP Basic Auth credentials for built-in routes.");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Authenticated firmware upload endpoint.");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Firmware OTA");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "class='toolgrid'");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "<section class='panel formpanel hostpanel'><h2>Hostname</h2>");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "class='hostfacts'");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "<b>Restart</b>");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "class='hostedit'");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Hostname");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Save Hostname");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Watchdog trip");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Reset Watchdog Trip");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "action='/esp32base/tools/watchdog-trip-reset'");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Restart device");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "<section class='panel dangerpanel'><h2>Restart device</h2>");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Format LittleFS");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "Free heap:");
    RUN_SELFTEST("GET", "/esp32base/tools", nullptr, true, 200, "RSSI:");
    RUN_SELFTEST("GET", "/esp32base/tools?hostname_saved=1", nullptr, true, 200, "Hostname saved");
    RUN_SELFTEST("GET", "/esp32base/tools?formatted=1", nullptr, true, 200, "LittleFS formatted");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "<title>App Config</title>");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Application configuration values stored by Esp32Base.");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Stored value");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Device code");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Confirm changes");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "id='acbox' class='confirmbox'><h2>Confirm changes</h2><div class='tablewrap'><table>");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Save App Config");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "data-group='General'");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "class=\\\"acgroup\\\"");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "class='tag warn restart'>restart</span>");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Multiplier");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Offset");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Timeout");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Safe mode");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Mode");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Profile");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "Raw minimum");
    RUN_SELFTEST("GET", "/esp32base/app-config", nullptr, true, 200, "-2147483648");
    RUN_SELFTEST("POST", "/esp32base/app-config", "rev=1&f0=demo&f1=A1&f2=50&f3=1.25&f4=-0.50&f5=30&f6=1&f8=auto&f9=balanced&f10=-2147483648", true, 303, "Location: /esp32base/app-config");
    RUN_SELFTEST("GET", "/dashboard", nullptr, true, 200, "<title>Dashboard</title>");
    RUN_SELFTEST("GET", "/control", nullptr, true, 200, "<title>Control</title>");
    RUN_SELFTEST("GET", "/control", nullptr, true, 200, "<style id='full-demo-head-extra'>");
    RUN_SELFTEST("GET", "/control", nullptr, true, 200, "<a href='/control' class='active'>Control</a>");
    RUN_SELFTEST("GET", "/control", nullptr, true, 200, "type='checkbox'");
    RUN_SELFTEST("GET", "/control", nullptr, true, 200, "type='radio'");
    RUN_SELFTEST("GET", "/control/edit", nullptr, true, 200, "<a href='/control' class='active'>Control</a>");
    RUN_SELFTEST("GET", "/control/edit", nullptr, true, 200, "<footer class='footerbar'><span class='syslinks'>");
    RUN_SELFTEST("GET", "/ui-status", nullptr, true, 200, "状态概览模板");
    RUN_SELFTEST("GET", "/ui-stats", nullptr, true, 200, "统计摘要模板");
    RUN_SELFTEST("GET", "/ui-records?page=2", nullptr, true, 200, "共 128 条 / 7 页");
    RUN_SELFTEST("GET", "/ui-records?page=2", nullptr, true, 200, "page=1'>上一页");
    RUN_SELFTEST("GET", "/ui-config?saved=1", nullptr, true, 200, "保存成功");
    RUN_SELFTEST("GET", "/ui-action", nullptr, true, 200, "操作命令模板");
    RUN_SELFTEST("POST", "/ui-action/run", "run=1", true, 303, "Location: /ui-action?saved=1");
    RUN_SELFTEST("GET", "/ui-flow?saved=1", nullptr, true, 200, "流程向导模板");
    RUN_SELFTEST("GET", "/ui-maintenance", nullptr, true, 200, "诊断维护模板");
    RUN_SELFTEST("GET", "/ui-access", nullptr, false, 200, "访问控制模板");
    RUN_SELFTEST("GET", "/api/control", nullptr, true, 200, "\"method\":\"GET\"");
    RUN_SELFTEST("GET", "/api/csv", nullptr, true, 200, "Content-Type: text/csv");
    RUN_SELFTEST("GET", "/api/csv", nullptr, true, 200, "Content-Disposition: attachment");
    RUN_SELFTEST("POST", "/api/control", "value=selftest", true, 303, "Location: /control?saved=1");
    RUN_SELFTEST("GET", "/dashboard", nullptr, true, 200, "Stored value: selftest");
    RUN_SELFTEST("POST", "/esp32base/logs/clear", nullptr, true, 303, "Location: /esp32base/logs?cleared=1");
    RUN_SELFTEST("GET", "/esp32base/logs?cleared=1", nullptr, true, 200, "Logs cleared");
    RUN_BOOL(Esp32BaseWeb::verifyAuth("admin", "admin"));
    RUN_BOOL(Esp32BaseWeb::saveAuth("selftest_user", "selftestPass1"));
    RUN_BOOL(Esp32BaseWeb::verifyAuth("selftest_user", "selftestPass1"));
    Esp32BaseWeb::setDefaultAuth("admin", "admin");
    RUN_BOOL(!Esp32BaseWeb::verifyAuth("admin", "admin"));
    RUN_BOOL(Esp32BaseWeb::verifyAuth("selftest_user", "selftestPass1"));
    RUN_BOOL(Esp32BaseWeb::resetAuth());
    RUN_BOOL(Esp32BaseWeb::verifyAuth("admin", "admin"));
#undef RUN_BOOL
#undef RUN_SELFTEST
    if (wdtRemoved) {
        Esp32BaseWatchdog::restoreCurrentTaskAfterLongOperation();
    }
    ESP32BASE_LOG_I("selftest", "summary pass=%u total=%u", static_cast<unsigned>(pass), static_cast<unsigned>(total));
}
#endif

void handleHeadExtra() {
    Esp32BaseWeb::sendChunk("<style id='full-demo-head-extra'>nav a.active{font-weight:700}</style>");
}

void handleDashboard() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    char value[64] = "";
    Esp32BaseConfig::getStr(APP_NS, APP_KEY_VALUE, value, sizeof(value), "(empty)");
    Esp32BaseWeb::sendHeader("Dashboard");
    Esp32BaseWeb::sendChunk("<h2>Dashboard</h2><p>Firmware: ");
    Esp32BaseWeb::writeHtmlEscaped(Esp32Base::firmwareName());
    Esp32BaseWeb::sendChunk(" ");
    Esp32BaseWeb::writeHtmlEscaped(Esp32Base::firmwareVersion());
    Esp32BaseWeb::sendChunk("</p><p>Stored value: ");
    Esp32BaseWeb::writeHtmlEscaped(value);
    Esp32BaseWeb::sendChunk("</p><p><a href='/esp32base/logs'>Logs</a> <a href='/esp32base/ota'>OTA</a></p>");
    Esp32BaseWeb::sendFooter();
}

